# MixedDerivs Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HermiteFace..::..MixedDerivs Property
HermiteFace Class See Also
---
Mixed derivatives of the surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<XYZ> MixedDerivs { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MixedDerivs As IList(Of XYZ)
	Get
```

Visual C++
---
```text
public:
property IList<XYZ^>^ MixedDerivs {
	IList<XYZ^>^ get ();
}
```

# See Also
HermiteFace Class
Autodesk.Revit.DB Namespace